Papasta/stm32-tdoa-acoustic-localization-node/MASTER_MODULE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define W5500_CS_Pin GPIO_PIN_4
#define W5500_CS_GPIO_Port GPIOA
#define W5500_RST_Pin GPIO_PIN_0
#define W5500_RST_GPIO_Port GPIOB
#define W5500_INT_Pin GPIO_PIN_1
#define W5500_INT_GPIO_Port GPIOB
#define W5500_INT_EXTI_IRQn EXTI1_IRQn
#define NRF2_CSN_Pin GPIO_PIN_12
#define NRF2_CSN_GPIO_Port GPIOB
#define NRF2_IRQ_Pin GPIO_PIN_8
#define NRF2_IRQ_GPIO_Port GPIOA
#define NRF2_IRQ_EXTI_IRQn EXTI9_5_IRQn
#define NRF2_CE_Pin GPIO_PIN_9
#define NRF2_CE_GPIO_Port GPIOA
#define NRF3_IRQ_Pin GPIO_PIN_11
#define NRF3_IRQ_GPIO_Port GPIOA
#define NRF3_IRQ_EXTI_IRQn EXTI15_10_IRQn
#define NRF3_CE_Pin GPIO_PIN_12
#define NRF3_CE_GPIO_Port GPIOA
#define NRF3_CSN_Pin GPIO_PIN_15
#define NRF3_CSN_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */